home/editors/emacs/config/config.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(setq straight-use-package-by-default 't)

;; This is done to avoid org version mismatch
(straight-use-package 'org)

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (evil-mode)
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
  (use-package evil-tutor))

(use-package general
  :config
  (general-evil-setup)

  (general-create-definer no/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; leader key
    :global-prefix "M-SPC" ;; leader in insert mode
    )

(no/leader-keys
  "b"  '(:ignore t :wk "Buffer")
  "b b" '(switch-to-buffer :wk "Switch buffer")
  "b i" '(ibuffer :wk "List buffers")
  "b k" '(kill-this-buffer :wk "Kill current buffer")
  "b n" '(next-buffer :wk "Next buffer")
  "b p" '(previous-buffer :wk "Previous buffer")
  "b r" '(revert-buffer :wk "Reload buffer"))

(no/leader-keys
  "e" '(:ignore t :wk "Evaluate")
  "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
  "e d" '(eval-defun :wk "Evaluate defun containing or after point")
  "e e" '(eval-expression :wk "Evaluate and elisp expression")
  "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
  "e r" '(eval-region :wk "Evaluate elisp in region"))

(no/leader-keys
  "."  '(find-file :wk "Find file")
  "TAB TAB" '(comment-line :wk "Comment lines")
  "f p" '((lambda () (interactive) (find-file "~/Documentos/dots-flake/home/editors/emacs/config/config.org")) :wk "Edit emacs configuration")
  "f r" '(recentf-open :wk "Recent files"))

(no/leader-keys
  "h" '(:ignore t :wk "pls help")
  "h f" '(describe-function :wk "Describe function")
  "h v" '(describe-variable :wk "Describe variable")
  "h r r" '(nice/reload-init-file :wk "Reload emacs config"))

(no/leader-keys
  "p" '(:ignore t :wk "Projectile")
  "p p" '(projectile-dired :wk "Projectile Dired"))

(no/leader-keys
  "t" '(:ignore t :wk "Toggle")
  "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
  "t t" '(visual-line-mode :wk "Toggle truncated lines"))
) ;; rember if adding new leader-keys, add this parenthesis or emacs will hate u

(use-package corfu
  ;; Optional customizations
  :custom
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ;; Enable auto completion
  (setq-default corfu-auto-prefix 0
		corfu-auto-delay 0)
  ;; (corfu-separator ?\s)          ;; Orderless field separator
  ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  ;; (corfu-preview-current nil)    ;; Disable current candidate preview
  ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  ;; (corfu-scroll-margin 5)        ;; Use scroll margin

  ;; Enable Corfu only for certain modes.
  ;; :hook ((prog-mode . corfu-mode)
  ;;        (shell-mode . corfu-mode)
  ;;        (eshell-mode . corfu-mode))

  ;; Recommended: Enable Corfu globally.
  ;; This is recommended since Dabbrev can be used globally (M-/).
  ;; See also `corfu-exclude-modes'.

  (use-package kind-icon
    :after corfu
    :custom
    (kind-icon-default-face 'corfu-default)
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

  ;; This function enables corfu in minibuffer
  (defun corfu-enable-in-minibuffer ()
  "Enable Corfu in the minibuffer if `completion-at-point' is bound."
  (when (where-is-internal #'completion-at-point (list (current-local-map)))
    ;; (setq-local corfu-auto nil) ;; Enable/disable auto completion
    (setq-local corfu-echo-delay nil ;; Disable automatic echo and popup
		corfu-popupinfo-delay nil)
    (corfu-mode 1)))
  (add-hook 'minibuffer-setup-hook #'corfu-enable-in-minibuffer)
  :init
  (global-corfu-mode))

(use-package aggressive-indent
  :init
  (global-aggressive-indent-mode 1)
  :config
  ;; Maybe I will put rust here
  (add-to-list 'aggressive-indent-excluded-modes 'html-mode)
  ;; C being funky, stop pls
  (add-to-list 'aggressive-indent-dont-indent-if
               '(and (derived-mode-p 'c++-mode)
                     (null (string-match "\\([;{}]\\|\\b\\(if\\|for\\|while\\)\\b\\)"
                                         (thing-at-point 'line))))))

(use-package emmet-mode
  :ensure t
  :hook
  ;; Enables emmet's CSS abbreviation
  (css-mode-hook . emmet-mode)
  ;; Auto-start emmet on any markup mode
  (sgml-mode-hook . emmet-mode))

(setq dired-listing-switches "-alhv --group-directories-first --color=always")

;; does this even work?
(setq electric-pair-pairs `((123 . 125) ; { }
                            (40 . 41)   ; ( )
                            (91 . 93)   ; [ ]
                            (34 . 34)   ; " "
                            (96 . 39)   ; ` '
                            (8216 . 8217) ; ‘ ’
                            (8220 . 8221))) ; “ ”
(electric-pair-mode 1)

(use-package lsp-mode
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (setq gc-cons-threshold 100000000
        read-process-output-max (* 1024 1024)
        lsp-idle-delay 0.500
        lsp-log-io nil)
  :hook (
         (prog-mode . lsp-deferred)
         (lsp-mode . lsp-enable-which-key-integration))
  :commands (lsp lsp-deferred))

(use-package lsp-ui
  :commands lsp-ui-mode)

(use-package nix-mode
  :mode ("\\.nix\\'" "\\.nix.in\\'")
  :init

  ;; Another one from doom emacs, this treats flake.lock files as json.
  (add-to-list 'auto-mode-alist
               (cons "/flake\\.lock\\'"
                     (if (featurep 'json-mode)
                         'json-mode
                       'js-mode))))
