home/editors/emacs/config/config.org
*** Auto Tangle
#+begin_src emacs-lisp
  (defun org-auto-tangle ()
    (when (eq major-mode 'org-mode)
      (org-babel-tangle)))

  (add-hook 'after-save-hook 'org-auto-tangle)
#+end_src

*** Disabling Electric Indent
#+begin_src emacs-lisp
  (electric-indent-mode -1)
#+end_src

*** Enabling org bullets
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-superstar)
  (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1)))
#+end_src

*** Enabling table of contents
#+begin_src emacs-lisp
  (use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** Source Code Block Tag Expansion
#+begin_src emacs-lisp
  (require 'org-tempo)
#+end_src

*** Edit Special Full
#+begin_src emacs-lisp
  (setq org-src-window-setup 'current-window)
#+end_src

* Custom functions
** Install all treesitter languages
#+begin_src emacs-lisp 
  (defun nice/treesit-install-all-languages ()
    "Install all languages specified by `treesit-language-source-alist'."
    (interactive)
    (let ((languages (mapcar 'car treesit-language-source-alist)))
      (dolist (lang languages)
        (treesit-install-language-grammar lang)
        (message "`%s' parser was installed." lang)
        (sit-for 0.75))))
#+end_src
** Reload Emacs
this is straight from dt config ok, well almost all of this config is but ok i guess
#+begin_src emacs-lisp
  (defun nice/reload-init-file ()
    (interactive)
    (load-file user-init-file)
    (load-file user-init-file))
#+end_src

* Fonts
** Setting up font face
#+begin_src emacs-lisp
  (defvar nice/default-font-size 120
    "Default font size for fixed pitch")

  (defvar nice/default-variable-font-size 140
    "Default font size for variable pitch")

  (set-face-attribute 'default nil
                      :font "Iosevka Nerd Font"
                      :height nice/default-font-size
                      :weight 'medium)
  (set-face-attribute 'variable-pitch nil
                      :font "JetBrainsMonoNL Nerd Font"
                      :height nice/default-variable-font-size
                      :weight 'medium)
  (set-face-attribute 'font-lock-comment-face nil
                      :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face nil
                      :slant 'italic)

  ;; I mean, DT added it and it kinda makes difference
  ;; so I'm adding this too
  (add-to-list 'default-frame-alist '(font . "Iosevka Nerd Font-12"))

  (setq-default line-spacing 0.12)
#+end_src

* Format All
** Minor Mode
It won't work using hook, probaly because it's missing this hook when starting.
Solution was to use force.
#+begin_src emacs-lisp
  (use-package format-all
    :init
    (add-hook 'format-all-mode-hook 'format-all-ensure-formatter)
    (add-hook 'prog-mode-hook 'format-all-mode)
    :config
    (setq format-all-show-errors 'warnings))
#+end_src
** Preferred formatters
For the case you don't want to use format-all default formatters, just add a value to this list.
My main use for now is setting Nix formatter to Alejandra instead of nixfmt.
#+begin_src emacs-lisp
  (setq-default format-all-default-formatters
        '(("Assembly" asmfmt)                   ;;
          ("ATS" atsfmt)                        ;;
          ("Bazel" buildifier)                  ;;
          ("BibTeX" emacs-bibtex)               ;;
          ("C" clang-format)                    ;; clang-format, astyle 
          ("C#" csharpier)                      ;; clang-format, csharpier, astyle 
          ("C++" clang-format)                  ;; clang-format, astyle
          ("Cabal Config" cabal-fmt)            ;;
          ("Clojure" zprint)                    ;; zprint, node-cljfmt
          ("CMake" cmake-format)                ;;
          ("Crystal" crystal)                   ;;
          ("CSS" prettier)                      ;; prettier, prettierd
          ("Cuda" clang-format)                 ;;
          ("D" dfmt)                            ;;
          ("Dart" dart-format)                  ;; dartfmt, dart-format
          ("Dhall" dhall)                       ;;
          ("Dockerfile" dockfmt)                ;;
          ("Elixir" mix-format)                 ;;
          ("Elm" elm-format)                    ;;
          ("Emacs Lisp" emacs-lisp)             ;;
          ("Erlang" efmt)                       ;;
          ("F#" fantomas)                       ;;
          ("Fish" fish-indent)                  ;;
          ("Fortran Free Form" fprettify)       ;;
          ("GLSL" clang-format)                 ;;
          ("Go" gofmt)                          ;; gofmt, goimports
          ("GraphQL" prettier)                  ;; prettier, prettierd
          ("Haskell" brittany)                  ;; brittany, fourmolu, hindent, ormolu, stylish-haskell
          ("HTML" html-tidy)                    ;;
          ("HTML+EEX" mix-format)               ;;
          ("HTML+ERB" erb-format)               ;;
          ("Java" clang-format)                 ;; clang-format, astyle
          ("JavaScript" prettier)               ;; prettier, standard, prettierd, deno 
          ("JSON" prettier)                     ;; prettier, standard, prettierd, deno
          ("JSON5" prettier)                    ;; prettier, standard, prettierd, deno
          ("Jsonnet" jsonnetfmt)                ;;
          ("JSX" prettier)                      ;; prettier, standard, prettierd, deno
          ("Kotlin" ktlint)                     ;;
          ("LaTeX" latexindent)                 ;; latexindent, auctex
          ("Less" prettier)                     ;;
          ("Literate Haskell" brittany)         ;;
          ("Lua" lua-fmt)                       ;; lua-fmt, stylua, prettier plugin
          ("Markdown" prettier)                 ;; prettier, prettierd, deno
          ("Nix" alejandra)                     ;; nixpkgs-fmt, nixfmt, alejandra
          ("Objective-C" clang-format)          ;; clang-format, astyle
          ("OCaml" ocp-indent)                  ;; ocp-indent, ocamlformat
          ("Perl" perltidy)                     ;; 
          ("PHP" prettier)                      ;;
          ("Protocol Buffer" clang-format)      ;;
          ("PureScript" purty)                  ;; purty, purescript-tidy
          ("Python" black)                      ;; black, yapf, isort
          ("R" styler)                          ;; 
          ("Reason" bsrefmt)                    ;;
          ("ReScript" rescript)                 ;;
          ("Ruby" rufo)                         ;; rubocop, rufo, standardrb, stree
          ("Rust" rustfmt)                      ;;
          ("Scala" scalafmt)                    ;;
          ("SCSS" prettier)                     ;;
          ("Shell" shfmt)                       ;; beautysh, shfmt
          ("Solidity" prettier)                 ;; pgformatter, sqlformat
          ("SQL" sqlformat)                     ;;
          ("Svelte" prettier)                   ;;
          ("Swift" swiftformat)                 ;;
          ("Terraform" terraform-fmt)           ;;
          ("TOML" prettier)                     ;; prettier, taplo fmt
          ("TSX" prettier)                      ;; prettier, ts-standard, prettierd, deno
          ("TypeScript" prettier)               ;; prettier, ts-standard, prettierd, deno
          ("V" v-fmt)                           ;;
          ("Verilog" istyle-verilog)            ;; iStyle, Verible
          ("Vue" prettier)                      ;; prettier, prettierd
          ("XML" html-tidy)                     ;; 
          ("YAML" prettier)                     ;; prettier, prettierd
          ("Zig" zig)                           ;;

          ("_Angular" prettier)                 ;;
          ("_Beancount" bean-format)            ;;
          ("_Caddyfile" caddy-fmt)              ;;
          ("_Flow" prettier)                    ;;
          ("_Gleam" gleam)                      ;;
          ("_Ledger" ledger-mode)               ;;
          ("_Nginx" nginxfmt)                   ;;
          ("_Snakemake" snakefmt)))             ;;
#+end_src

** Formatter Parameters
Some formatters, for unknown reasons known to men, require an argument to shut up and.
Because this isn't the default, I just override the formatter definition instead.
#+begin_src emacs-lisp
  (define-format-all-formatter alejandra
                               (:executable "alejandra")
                               (:install "nix-env -if https://github.com/kamadorueda/alejandra/tarball/master")
                               (:languages "Nix")
                               (:features)
                               (:format (format-all--buffer-easy executable "--quiet")))

#+end_src
