home/editors/emacs/config/config.org
* Graphical User Interface Tweaks
** Dashboard
I like pretty stuff, who doesn't like pretty stuff?
Actually, this is pretty much useless since I spent so little time in the dashboard, but it's nice to have something pretty to look at.
#+begin_src emacs-lisp

#+end_src
** Disabling annoying stuff
#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)

  (setq create-lockfiles nil)
#+end_src

** Icons
This is quickly becoming a mess.
I mean, just look at kind-icon-mapping.

#+begin_src emacs-lisp
  (use-package nerd-icons
    :after corfu
    :config
    (use-package nerd-icons-completion
      :config
      (nerd-icons-completion-mode))

    (use-package nerd-icons-ibuffer
      :hook (ibuffer-mode . nerd-icons-ibuffer-mode)
      :config
      (setq nerd-icons-ibuffer-icon-size 0.8))

    (use-package nerd-icons-dired
      :hook
      (dired-mode . nerd-icons-dired-mode))
  
    (setq kind-icon-use-icons nil)
    (setq kind-icon-mapping
          `(
            (array ,(nerd-icons-codicon "nf-cod-symbol_array") :face font-lock-type-face)
            (boolean ,(nerd-icons-codicon "nf-cod-symbol_boolean") :face font-lock-builtin-face)
            (class ,(nerd-icons-codicon "nf-cod-symbol_class") :face font-lock-type-face)
            (color ,(nerd-icons-codicon "nf-cod-symbol_color") :face success)
            (command ,(nerd-icons-codicon "nf-cod-terminal") :face default)
            (constant ,(nerd-icons-codicon "nf-cod-symbol_constant") :face font-lock-constant-face)
            (constructor ,(nerd-icons-codicon "nf-cod-triangle_right") :face font-lock-function-name-face)
            (enummember ,(nerd-icons-codicon "nf-cod-symbol_enum_member") :face font-lock-builtin-face)
            (enum-member ,(nerd-icons-codicon "nf-cod-symbol_enum_member") :face font-lock-builtin-face)
            (enum ,(nerd-icons-codicon "nf-cod-symbol_enum") :face font-lock-builtin-face)
            (event ,(nerd-icons-codicon "nf-cod-symbol_event") :face font-lock-warning-face)
            (field ,(nerd-icons-codicon "nf-cod-symbol_field") :face font-lock-variable-name-face)
            (file ,(nerd-icons-codicon "nf-cod-symbol_file") :face font-lock-string-face)
            (folder ,(nerd-icons-codicon "nf-cod-folder") :face font-lock-doc-face)
            (interface ,(nerd-icons-codicon "nf-cod-symbol_interface") :face font-lock-type-face)
            (keyword ,(nerd-icons-codicon "nf-cod-symbol_keyword") :face font-lock-keyword-face)
            (macro ,(nerd-icons-codicon "nf-cod-symbol_misc") :face font-lock-keyword-face)
            (magic ,(nerd-icons-codicon "nf-cod-wand") :face font-lock-builtin-face)
            (method ,(nerd-icons-codicon "nf-cod-symbol_method") :face font-lock-function-name-face)
            (function ,(nerd-icons-codicon "nf-cod-symbol_method") :face font-lock-function-name-face)
            (module ,(nerd-icons-codicon "nf-cod-file_submodule") :face font-lock-preprocessor-face)
            (numeric ,(nerd-icons-codicon "nf-cod-symbol_numeric") :face font-lock-builtin-face)
            (operator ,(nerd-icons-codicon "nf-cod-symbol_operator") :face font-lock-comment-delimiter-face)
            (param ,(nerd-icons-codicon "nf-cod-symbol_parameter") :face default)
            (property ,(nerd-icons-codicon "nf-cod-symbol_property") :face font-lock-variable-name-face)
            (reference ,(nerd-icons-codicon "nf-cod-references") :face font-lock-variable-name-face)
            (snippet ,(nerd-icons-codicon "nf-cod-symbol_snippet") :face font-lock-string-face)
            (string ,(nerd-icons-codicon "nf-cod-symbol_string") :face font-lock-string-face)
            (struct ,(nerd-icons-codicon "nf-cod-symbol_structure") :face font-lock-variable-name-face)
            (text ,(nerd-icons-codicon "nf-cod-text_size") :face font-lock-doc-face)
            (typeparameter ,(nerd-icons-codicon "nf-cod-list_unordered") :face font-lock-type-face)
            (type-parameter ,(nerd-icons-codicon "nf-cod-list_unordered") :face font-lock-type-face)
            (unit ,(nerd-icons-codicon "nf-cod-symbol_ruler") :face font-lock-constant-face)
            (value ,(nerd-icons-codicon "nf-cod-symbol_field") :face font-lock-builtin-face)
            (variable ,(nerd-icons-codicon "nf-cod-symbol_variable") :face font-lock-variable-name-face)
            (t ,(nerd-icons-codicon "nf-cod-code") :face font-lock-warning-face))))
#+end_src

** Line Numbers and Truncated Lines
#+begin_src emacs-lisp
  (global-display-line-numbers-mode 1)
  (global-visual-line-mode t)
#+end_src

** Modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :config
    ;; minions! well i find this cool so lets install it
    (use-package minions
      :config (minions-mode 1))
    ;; Actual doom-modeline settings
    (setq doom-modeline-hud t
          doom-modeline-height 27
          doom-modeline-bar-width 2
          doom-modeline-window-width-limit 80
          doom-modeline-buffer-file-name-style 'relative-from-project
          doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode html-mode))
    :hook (after-init . doom-modeline-mode))
#+end_src

** Setting Alpha Background
#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(alpha-background . 78))
#+end_src

** Theming
#+begin_src emacs-lisp
  (use-package catppuccin-theme
    :config
    (setq catppuccin-flavor 'macchiato)
    (load-theme 'catppuccin t)

    ;; line numbers are almost invisible with background alpha
    (custom-set-faces '(line-number ((t (:foreground "#656a7a"))))))

#+end_src
* Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :init
    (projectile-mode +1)
    :config
    (setq projectile-project-search-path '("~/Documentos")))

#+end_src

* Treesitter
Emacs 29+ comes with native treesitter support. While it can be a hassle to setup, it's pretty cool so I'm doing that.
Below we require treesit and add language bindings to a list, so Emacs can build them.
** Defining languages
#+begin_src emacs-lisp
  (require 'treesit)

  (setq treesit-language-source-alist
        '((bash . ("https://github.com/tree-sitter/tree-sitter-bash"))
          (c . ("https://github.com/tree-sitter/tree-sitter-c"))
          (cpp . ("https://github.com/tree-sitter/tree-sitter-cpp"))
          (css . ("https://github.com/tree-sitter/tree-sitter-css"))
          (go . ("https://github.com/tree-sitter/tree-sitter-go"))
          (html . ("https://github.com/tree-sitter/tree-sitter-html"))
          (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript"))
          (json . ("https://github.com/tree-sitter/tree-sitter-json"))
          (lua . ("https://github.com/Azganoth/tree-sitter-lua"))
          (make . ("https://github.com/alemuller/tree-sitter-make"))
          (python . ("https://github.com/tree-sitter/tree-sitter-python"))
          (php . ("https://github.com/tree-sitter/tree-sitter-php"))
          (ruby . ("https://github.com/tree-sitter/tree-sitter-ruby"))
          (rust . ("https://github.com/tree-sitter/tree-sitter-rust"))
          (sql . ("https://github.com/m-novikov/tree-sitter-sql"))
          (toml . ("https://github.com/tree-sitter/tree-sitter-toml"))
          (zig . ("https://github.com/GrayJack/tree-sitter-zig"))
          ;; add more here dumb
          ))
#+end_src

** Mode remapping
Some modes do not have a treesitter binding, but are similar to others that do have.
Still looking for a way to make rustic work tho.
#+begin_src emacs-lisp
  (add-to-list 'major-mode-remap-alist
               '(sh-mode . bash-ts-mode))
#+end_src

